{
  "basics": {
    "name": "Jeremy Moseley",
    "label": "Product Engineer",
    "summary": "Jeremy is a focused engineer who is intrigued by the design and architecture of distributed systems. He has experience with distributed systems in Typescript, Go, Scala, and Python, and has spent time in most parts of the stack, doing infrastructure, product work, and some front-end.",
    "phone": "1-415-926-1955",
    "email": "jeremy.moseley@gmail.com",
    "location": {
      "postalCode": "V8Y 2J5",
      "city": "Victoria",
      "countryCode": "CA",
      "region": "BC"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "jmoseley",
        "url": "https://github.com/jmoseley"
      },
      {
        "network": "LinkedIn",
        "username": "Jeremy Moseley",
        "url": "https://www.linkedin.com/in/jeremy-moseley-b3366437"
      }
    ]
  },
  "work": [
    {
      "company": "Convoy",
      "website": "https://www.convoy.com",
      "position": "Software Engineer",
      "startDate": "2016-11-03",
      "summary": "Grown with Convoy as it scales its business and organization, from 12 engineers to >200, working on a variety of teams and problem spaces.",
      "highlights": [
        "Lead and architected a new platform that replaces Convoys internal user facing tools, and enables Convoy to scale its business operations through the next 10x growth period.",
        "Built a tool that allowed non-technical users to manage system configuration that previously required an entire engineer worth of effort.",
        "Mentoring more junior engineers at various stages of their careers (non-traditional background & first job, lightly experienced & starting to tackle larger scope, and traditional background & somewhat experienced).",
        "Working on projects with Org wide scope, evangelizing and pushing on solutions to large technical project with a large breadth of stakeholders.",
        "Maintain and extend systems that allow complex integrations with external customer systems.",
        "Technology: Typescript/Javascript, PostgreSQL, AWS, React"
      ]
    },
    {
      "company": "Inkling Systems Inc.",
      "website": "https://www.inkling.com",
      "position": "Import/Export Software Engineer 3",
      "startDate": "2015-06-01",
      "endDate": "2016-11-03",
      "summary": "The Import/Export squad manages all methods for bring content into and out of the Inkling platform, providing infrastructure for converting content from Word to HTML, HTML to EPUB and PDF, as well as conversion to internal formats for Inkling's internal readers.",
      "highlights": [
        "Reduced content export errors by 10%, increasing customer satisfaction and reducing customer support overhead.",
        "Architected a new microservice using the Play framework and an SQS task processor to provide a scalable worker system to allow easy scaling for demand",
        "Developed a successful Seattle intern program",
        "Technology: Scala, Java, Play, AWS, SQS, PostgreSQL, Python, XML"
      ]
    },
    {
      "company": "Inkling Systems Inc.",
      "website": "https://www.inkling.com",
      "position": "Infrastructure Engineer",
      "startDate": "2014-06-22",
      "endDate": "2015-06-01",
      "summary": "The infrastructure team manages infrastructure tooling and AWS deployment of the Inkling stack. Supports other engineering teams to make the system more reliable and easier to work with.",
      "highlights": [
        "Implemented a state-of-the-art distributed log systems that handles 30 million events a day.",
        "Migrated Inkling's deployment and packaging system to Docker, allowing the system to be deployed and managed by state-of-the-art tools",
        "Significantly reduced downtime caused by deployments",
        "Increasing engineering efficiency when developing and deploying new services",
        "Operated as a member of the emergency on-call rotation",
        "Technology: Scala, AWS, Python, Bash, PostgreSQL, Docker"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Victoria",
      "area": "Software Engineering",
      "studyType": "Bachelor",
      "courses": [],
      "startDate": "2009-09-01",
      "endDate": "2014-05-31"
    },
    {
      "institution": "SAIT Polytechnic",
      "area": "Computer Engineering Technology",
      "studyType": "Associates Degree",
      "courses": [],
      "startDate": "2006-01-03",
      "endDate": "2007-12-22"
    }
  ],
  "skills": [
    {
      "name": "Frontend",
      "keywords": [
        "React",
        "HTML/CSS",
        "Typescript/JavaScript",
        "Next",
        "Redux",
        "GraphQL"
      ]
    },
    {
      "name": "Backend",
      "keywords": [
        "Typescript/Javascript",
        "Node",
        "Python",
        "Postgres",
        "Distributed Systems",
        "Temporal"
      ]
    },
    {
      "name": "DevOps",
      "keywords": [
        "DataDog",
        "Bash",
        "AWS",
        "Heroku",
        "Hasura"
      ]
    }
  ]
}
