{
  "basics": {
    "name": "Jeremy Moseley",
    "label": "Full Stack Engineer",
    "summary": "Jeremy is a focused engineer who is intrigued by the design and architecture of distributed systems. He has experience with distributed systems in Scala, Python, and Typescript/Javascript, and has dabbled in everything from HTML to databases and operating systems.",
    "phone": "1-415-926-1955",
    "email": "jeremy.moseley@gmail.com",
    "location": {
      "address": "Jeremy Moseley\n14018 25th Ave NE\nSeattle, WA 98125",
      "postalCode": "98107",
      "city": "Seattle",
      "countryCode": "US",
      "region": "WA"
    },
    "profiles": [
      {
        "network": "GitHub",
        "username": "jmoseley",
        "url": "https://github.com/jmoseley"
      },
      {
        "network": "LinkedIn",
        "username": "Jeremy Moseley",
        "url": "https://www.linkedin.com/in/jeremy-moseley-b3366437"
      }
    ]
  },
  "work": [
    {
      "company": "Convoy",
      "website": "https://www.convoy.com",
      "position": "Software Engineer",
      "startDate": "2016-11-03",
      "summary": "Small agile team working to disrupt the freight industry using product driven development. Engineering work focusses on mobile and web apps built around a micro-service architecture using cutting edge technology like React and Node.",
      "highlights": [
        "Mentoring more junior engineers at various stages of their careers (non-traditional background & first job, lightly experienced & starting to tackle larger scope, and traditional background & somewhat experienced).",
        "Working on projects with Org wide scope, evangelizing and pushing on solutions to large technical project with organizational scope and a large breadth of stakeholders.",
        "Led the team to developed the first version of a system wide stress testing plan, used to ensure that our systems can handle extreme near-term growth.",
        "Learned Javascript and Node quickly become a productive member of the team, working closely with Product to develop useful features for both internal and external users.",
        "Maintain and extend systems that allow complex integrations with external customer systems.",
        "Technology: Typescript/Javascript, PostgreSQL, AWS, React"
      ]
    },
    {
      "company": "Inkling Systems Inc.",
      "website": "https://www.inkling.com",
      "position": "Import/Export Software Engineer 3",
      "startDate": "2015-06-01",
      "endDate": "2016-11-03",
      "summary": "The Import/Export squad manages all methods for bring content into and out of the Inkling platform, providing infrastructure for converting content from Word to HTML, HTML to EPUB and PDF, as well as conversion to internal formats for Inkling's internal readers.",
      "highlights": [
        "Reduced content export errors by 10%, increasing customer satisfaction and reducing customer support overhead.",
        "Architected a new microservice using the Play framework and an SQS task processor to provide a scalable worker system to allow easy scaling for demand",
        "Developed a successful Seattle intern program",
        "Technology: Scala, Java, Play, AWS, SQS, PostgreSQL, Python, XML"
      ]
    },
    {
      "company": "Inkling Systems Inc.",
      "website": "https://www.inkling.com",
      "position": "Infrastructure Engineer",
      "startDate": "2014-06-22",
      "endDate": "2015-06-01",
      "summary": "The infrastructure team manages infrastructure tooling and AWS deployment of the Inkling stack. Supports other engineering teams to make deployment and infrastructure management more reliable and easier to work with.",
      "highlights": [
        "Implemented a state-of-the-art distributed log systems that handles 30 million events a day.",
        "Migrated Inkling's deployment and packaging system to Docker",
        "Significantly reduced downtime caused by deployments",
        "Increasing engineering efficiency when developing and deploying new services",
        "Operated as a member of the emergency on-call rotation",
        "Technology: Scala, AWS, Python, Bash, PostgreSQL, Docker"
      ]
    },
    {
      "company": "Inkling Systems Inc.",
      "website": "https://www.inkling.com",
      "position": "Platform Engineering Intern",
      "startDate": "2013-09-25",
      "endDate": "2013-12-21",
      "summary": "Developed and deployed an XML database, and developed supporting features in the core Python API",
      "highlights": [
        "Wrote complex XQuery scripts and API interfaces",
        "Technology: BaseX, XPath, XQuery, XML, Python"
      ]
    },
    {
      "company": "Internet Shakespeare Editions",
      "website": "http://ise.uvic.ca",
      "position": "Part-time Developer",
      "startDate": "2012-10-01",
      "endDate": "2013-08-31",
      "summary": "Part-time member of a team while in studying, using XQuery and XPath to maintain and develop new features for a long-term academic project. Designed a mobile experience, as well as used XQuery and XPath to process and transform marked up content in a variety of interesting ways, depending on how the content was being consumed.",
      "highlights": [
        "Designed a mobile-first experience from scratch",
        "Wrote complex and performant XQuery scripts to transform marked up content on the fly for mobile consumption",
        "Technology: eXistDB, XPath, XQuery, XML, CSS, Javascript"
      ]
    },
    {
      "company": "Vineyard Networks",
      "position": "Co-op Engineer",
      "startDate": "2012-01-03",
      "endDate": "2012-08-31",
      "summary": "Developed deep packet inspection (DPI) plugins for a software package that runs on network hardware.",
      "highlights": [
        "Analyzed raw network traffic to extract patterns for various traffic types (HTTP, TCP, UDP, etc)",
        "Designed code to analyze Facebook, Google, Steam, and a variety of other application streams",
        "Technology: C++"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Victoria",
      "area": "Software Engineering",
      "studyType": "Bachelor",
      "gpa": "6.39",
      "courses": [],
      "startDate": "2009-09-01",
      "endDate": "2014-05-31"
    },
    {
      "institution": "SAIT Polytechnic",
      "area": "Computer Engineering Technology",
      "studyType": "Associates Degree",
      "gpa": "3.9",
      "courses": [],
      "startDate": "2006-01-03",
      "endDate": "2007-12-22"
    }
  ],
  "skills": [
    {
      "name": "Development Tools",
      "keywords": [
        "Visual Studio Code",
        "Intellij",
        "PyCharm",
        "Sublime Text 2/3",
        "Git",
        "SBT"
      ]
    },
    {
      "name": "Distributed Systems",
      "keywords": [
        "Queues",
        "Shared Memory",
        "Databases",
        "Redis",
        "AWS",
        "SQS",
        "SNS",
        "RabbitMQ",
        "Memcache",
        "Sharding",
        "Distributed System Design",
        "APIs",
        "API Design"
      ]
    },
    {
      "name": "Languages/Frameworks",
      "keywords": [
        "Play",
        "Slick",
        "Scala",
        "Java",
        "Bash",
        "Javascript",
        "Typescript",
        "ES6",
        "Node",
        "Python",
        "XQuery/XPath",
        "XML",
        "Meteor JS",
        "Bootstrap",
        "PHP",
        "React",
        "Redux"
      ]
    },
    {
      "name": "Database",
      "keywords": ["MySQL", "PostgreSQL", "RDS", "ORM", "Slick", "SQLAlchemy"]
    },
    {
      "name": "Cloud",
      "keywords": [
        "AWS",
        "ECS",
        "EC2",
        "S3",
        "Route53",
        "SNS",
        "SQS",
        "Heroku",
        "Hasura"
      ]
    }
  ],
  "interests": [
    {
      "name": "mountain biking",
      "summary": "Jeremy enjoys both cross-country and downhill mountain biking, both for the thrill and the athletic aspect. Jeremy has enjoyed mountain biking in the BC interior, California, and Seattle areas."
    },
    {
      "name": "technology",
      "summary": "Jeremy enjoys technology and the profound effect it has had and will continue to have on society. Jeremy is passionate about imagining the ways that technology can positively change a person's everyday life in unobtrusive and low impact ways.",
      "keywords": ["technology", "research", "user experience", "future"]
    }
  ],
  "languages": [
    {
      "language": "English",
      "level": "Native"
    }
  ]
}
